app/controllers/recipes_controller.rb

SELECT id FROM "users" WHERE "users"."username" = 'foo' LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 8 AND "recipes"."slug" = 'foo' LIMIT 1
---
  def fork
    user_id = User.select(:id).find_by_username(params[:username])
    recipe = Recipe.find_by_slug_and_user_id(params[:recipe], user_id)

SELECT id FROM "users" WHERE "users"."username" = 'baz' LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 6 AND "recipes"."slug" = 'foo' LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 11 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
---
  def show
    user_id = User.select(:id).find_by_username(params[:username])
    @recipe = Recipe.find_by_slug_and_user_id(params[:recipe], user_id)
    @forked_from_recipe = Recipe.find(@recipe.forked_from_recipe_id) if @recipe.forked_from_recipe_id

INSERT INTO "recipe_revisions" ("body", "commit_message", "created_at", "recipe_id", "revision", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "recipes" ("body", "commit_message", "created_at", "forked_from_recipe_id", "revision", "slug", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @recipe          = Recipe.new(params[:recipe_form])
    @recipe.revision = 1
    @recipe.user     = current_user
    @recipe.slug     = @recipe.title.parameterize
    @recipe.create_recipe_revision!

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 6 AND "recipes"."slug" = 'foo' LIMIT 1
UPDATE "recipes" SET "revision" = 2, "body" = 'bat', "commit_message" = 'next', "updated_at" = '2015-01-13 02:57:33.402337' WHERE "recipes"."id" = 5
INSERT INTO "recipe_revisions" ("body", "commit_message", "created_at", "recipe_id", "revision", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def update
    user_id = User.select(:id).find_by_username(params[:username])
    @recipe = Recipe.find_by_slug_and_user_id(params[:recipe], user_id)
    @recipe.increment_revision!

    respond_to do |format|
      if @recipe.update_attributes(params[:recipe_form])
         @recipe.create_recipe_revision!