app/controllers/recipes_controller.rb

SELECT COUNT(*) FROM "recipe_revisions" WHERE "recipe_revisions"."recipe_id" = 12
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."forked_from_recipe_id" = 12
---
  def show
    @recipe = find_recipe_by_slug_and_username(params[:recipe], params[:username])

    return render :inline => "We couldn't find that recipe in our system :(" unless @recipe

    @revision_count = RecipeRevision.where(:recipe_id => @recipe.id).count
    @forked_from_recipe = Recipe.find(@recipe.forked_from_recipe_id) if @recipe.forked_from_recipe_id

    @page_title = "ForkingRecipes - #{@recipe.user.username} / #{@recipe.title}"

    @forks  = Rails.cache.fetch("recipe_#{@recipe.id}_forked_count", :expires_in => 5.minutes) do
      Recipe.where(:forked_from_recipe_id => @recipe.id).count

INSERT INTO "events" ("action", "created_at", "recipe_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", "created"], ["created_at", Tue, 13 Jan 2015 02:40:47 UTC +00:00], ["recipe_id", 4], ["updated_at", Tue, 13 Jan 2015 02:40:47 UTC +00:00], ["user_id", 2]]
---
  def create
    @recipe          = Recipe.new(params[:recipe_form])
    @recipe.revision = 1
    @recipe.user     = current_user
    @recipe.slug     = @recipe.title.parameterize
    @recipe.create_recipe_revision!
    @recipe.upload_images!

    respond_to do |format|
      if @recipe.save
        Event.create(:user_id => @recipe.user.id, :recipe_id => @recipe.id, :action => "created")

INSERT INTO "events" ("action", "created_at", "recipe_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", "updated"], ["created_at", Tue, 13 Jan 2015 02:57:33 UTC +00:00], ["recipe_id", 5], ["updated_at", Tue, 13 Jan 2015 02:57:33 UTC +00:00], ["user_id", 5]]
---
  def update
    @recipe = find_recipe_by_slug_and_username(params[:recipe], params[:username])
    @recipe.increment_revision!

    respond_to do |format|
      if @recipe.update_attributes(params[:recipe_form])
        Event.create(:user_id => @recipe.user.id, :recipe_id => @recipe.id, :action => "updated")